In [132]:
import pandas as pd
import datetime as dt
from sqlalchemy import create_engine
from sqlalchemy.sql import text

In [102]:
cta_df = pd.read_csv('CTA_-_Ridership_-_Daily_Boarding_Totals_20240819.csv')
mta_df = pd.read_csv('MTA_Monthly_Ridership___Traffic_Data__Beginning_January_2008.csv')

In [103]:
mta_df.head()

        Month Agency  Ridership
0  01/01/2008    MNR    6453734
1  02/01/2008    MNR    6144377
2  03/01/2008    MNR    6602280
3  04/01/2008    B&T   24900328
4  04/01/2008    MNR    6787480

In [104]:
mta_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 719 entries, 0 to 718
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Month      719 non-null    object
 1   Agency     719 non-null    object
 2   Ridership  719 non-null    int64
dtypes: int64(1), object(2)
memory usage: 17.0+ KB

In [105]:
mta_df['Agency'].unique()

array(['MNR', 'B&T', 'Bus', 'Subway', 'LIRR', 'AAR', 'SIR'], dtype=object)

In [106]:
bus = mta_df['Agency']=='Bus'
metro = mta_df['Agency']!='Bus'
mta_df.loc[bus, 'Agency'] = 'bus'
mta_df.loc[metro, 'Agency'] = 'metro'

In [107]:
mta_df = mta_df.rename(columns={'Agency': 'transportation_type', 'Ridership': 'ridership_count', 'Month': 'month'})

In [108]:
mta_df.head(10)

        month transportation_type  ridership_count
0  01/01/2008               metro          6453734
1  02/01/2008               metro          6144377
2  03/01/2008               metro          6602280
3  04/01/2008               metro         24900328
4  04/01/2008               metro          6787480
5  05/01/2008               metro          6840901
6  05/01/2008               metro         26172575
7  06/01/2008               metro          7008657
8  06/01/2008               metro         25940107
9  07/01/2008               metro          7298152

In [109]:
def standardize_date(date: str):
    date_format = '%m/%d/%Y'
    date = dt.datetime.strptime(date, date_format)
    date = dt.date(year=date.year, month=date.month, day=1)
    return date.strftime(date_format)

In [110]:
mta_df['month'] = mta_df['month'].apply(standardize_date)

In [111]:
mta_df = mta_df.groupby(['month', 'transportation_type']).agg({'ridership_count': 'sum'}).reset_index()

In [112]:
mta_df['city'] = 'New York'

In [113]:
mta_df.head()

        month transportation_type  ridership_count      city
0  01/01/2008               metro          6453734  New York
1  01/01/2009               metro         28436944  New York
2  01/01/2010               metro         28536008  New York
3  01/01/2011               metro         26584121  New York
4  01/01/2012               metro         28476355  New York

In [114]:
cta_df.head(10)

  service_date day_type     bus  rail_boardings  total_rides
0   01/01/2001        U  297192          126455       423647
1   01/02/2001        W  780827          501952      1282779
2   01/03/2001        W  824923          536432      1361355
3   01/04/2001        W  870021          550011      1420032
4   01/05/2001        W  890426          557917      1448343
5   01/06/2001        A  577401          255356       832757
6   01/07/2001        U  375831          169825       545656
7   01/08/2001        W  985221          590706      1575927
8   01/09/2001        W  978377          599905      1578282
9   01/10/2001        W  984884          602052      1586936

In [115]:
cta_df = cta_df.drop(columns=['day_type', 'total_rides'])
cta_df

     service_date     bus  rail_boardings
0      01/01/2001  297192          126455
1      01/02/2001  780827          501952
2      01/03/2001  824923          536432
3      01/04/2001  870021          550011
4      01/05/2001  890426          557917
...           ...     ...             ...
8578   04/26/2024  554146          355278
8579   04/27/2024  419731          286199
8580   04/28/2024  293589          196481
8581   04/29/2024  556233          349857
8582   04/30/2024  632501          409097

[8583 rows x 3 columns]

In [116]:
cta_df = cta_df.melt(['service_date'], var_name='transportation_type', value_name='ridership_count')
cta_df

      service_date transportation_type  ridership_count
0       01/01/2001                 bus           297192
1       01/02/2001                 bus           780827
2       01/03/2001                 bus           824923
3       01/04/2001                 bus           870021
4       01/05/2001                 bus           890426
...            ...                 ...              ...
17161   04/26/2024      rail_boardings           355278
17162   04/27/2024      rail_boardings           286199
17163   04/28/2024      rail_boardings           196481
17164   04/29/2024      rail_boardings           349857
17165   04/30/2024      rail_boardings           409097

[17166 rows x 3 columns]

In [117]:
cta_df['service_date'] = cta_df['service_date'].apply(standardize_date)

In [118]:
cta_df = cta_df.groupby(['service_date', 'transportation_type']).agg({'ridership_count': 'sum'}).reset_index()

In [119]:
cta_df['city'] = 'Chicago'

In [120]:
cta_df.head()

  service_date transportation_type  ridership_count     city
0   01/01/2001                 bus         25022908  Chicago
1   01/01/2001      rail_boardings         14712334  Chicago
2   01/01/2002                 bus         24807048  Chicago
3   01/01/2002      rail_boardings         14575032  Chicago
4   01/01/2003                 bus         24105413  Chicago

In [121]:
cta_df = cta_df.rename(columns={'service_date': 'month'})

In [122]:
metro = cta_df['transportation_type']!='bus'
cta_df.loc[metro, 'transportation_type'] = 'metro'

In [123]:
cta_df.head()

        month transportation_type  ridership_count     city
0  01/01/2001                 bus         25022908  Chicago
1  01/01/2001               metro         14712334  Chicago
2  01/01/2002                 bus         24807048  Chicago
3  01/01/2002               metro         14575032  Chicago
4  01/01/2003                 bus         24105413  Chicago

In [127]:
monthly_totals_df = pd.concat([mta_df, cta_df], axis='rows')
monthly_totals_df

          month transportation_type  ridership_count      city
0    01/01/2008               metro          6453734  New York
1    01/01/2009               metro         28436944  New York
2    01/01/2010               metro         28536008  New York
3    01/01/2011               metro         26584121  New York
4    01/01/2012               metro         28476355  New York
..          ...                 ...              ...       ...
555  12/01/2021               metro          7040197   Chicago
556  12/01/2022                 bus         11092088   Chicago
557  12/01/2022               metro          7768789   Chicago
558  12/01/2023                 bus         13308801   Chicago
559  12/01/2023               metro          8766560   Chicago

[828 rows x 4 columns]

In [126]:
DATABASE_URL = 'postgresql://postgres.xpiejfrzvryejvjecyrv:Aryasupa2528#!@aws-0-us-east-1.pooler.supabase.com:6543/postgres'
engine = create_engine(DATABASE_URL)
engine

Engine(postgresql://postgres.xpiejfrzvryejvjecyrv:***@aws-0-us-east-1.pooler.supabase.com:6543/postgres)

In [128]:
with engine.connect() as conn:
    monthly_totals_df.to_sql("monthly_totals", conn, index=False)

In [134]:
bus_new_table = '''
CREATE TABLE bus_monthly_totals AS
SELECT month,ridership_count,city
FROM monthly_totals
WHERE transportation_type = 'bus' 
'''
with engine.connect() as conn:
    trans=conn.begin()
    qry = text(bus_new_table)
    conn.execute(qry)
    conn.commit()

In [135]:
metro_new_table = '''
CREATE TABLE metro_monthly_totals AS
SELECT month,ridership_count,city
FROM monthly_totals
WHERE transportation_type = 'metro' 
'''
with engine.connect() as conn:
    trans=conn.begin()
    qry = text(metro_new_table)
    conn.execute(qry)
    conn.commit()

In [137]:
bus_sql = "SELECT * FROM bus_monthly_totals"
bus_df = pd.read_sql(bus_sql, engine)

In [138]:
bus_df.head()

        month  ridership_count      city
0  01/01/2018         45398837  New York
1  01/01/2019         44510954  New York
2  01/01/2020         45145397  New York
3  01/01/2021         20769132  New York
4  01/01/2022         23255396  New York

In [139]:
metro_sql = "SELECT * FROM metro_monthly_totals"
metro_df = pd.read_sql(metro_sql, engine)

In [140]:
metro_df.head()

        month  ridership_count      city
0  01/01/2008          6453734  New York
1  01/01/2009         28436944  New York
2  01/01/2010         28536008  New York
3  01/01/2011         26584121  New York
4  01/01/2012         28476355  New York